Revit 2026 API

# ProjectPositionElevation Property

---

Elevation above ground level.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Elevation { get; set; }
```
```vb
Public Property Elevation As Double
	Get
	Set
```
```cpp
public:
property double Elevation {
	double get ();
	void set (double value);
}
```
```fsharp
member Elevation : float with get, set
```

#### Property Value

Double

Negative values are allowed. Measured in decimal feet.

#### Reference

ProjectPosition Class

Autodesk.Revit.DB Namespace